[
  {
    "title": "GRELEN: Multivariate Time Series Anomaly Detection from the Perspective of Graph Relational Learning.",
    "authors": "Weiqi Zhang and Chen Zhang and Fugee Tsung",
    "venue": "Unknown Venue",
    "year": 2022,
    "citations": 98,
    "url": "https://www.ijcai.org/proceedings/2022/0332.pdf",
    "eprint_url": "",
    "abstract": "System monitoring and anomaly detection is a crucial task in daily operation. With the rapid development of cyber-physical systems and IT systems, multiple sensors get involved to represent the system state from different perspectives, which inspires us to detect anomalies considering feature dependence relationship among sensors instead of focusing on individual sensor’s behavior. In this paper, we propose a novel Graph Relational Learning Network (GReLeN) to detect multivariate time series anomaly from the perspective of between-sensor dependence relationship learning. Variational AutoEncoder (VAE) serves as the overall framework for feature extraction and system representation. Graph Neural Network (GNN) and stochastic graph relational learning strategy are also imposed to capture the between-sensor dependence. Then a composite anomaly metric is established with the learned dependence structure explicitly. The experiments on four real-world datasets show our superiority in detection accuracy, anomaly diagnosis, and model interpretation."
  },
  {
    "title": "Tensor completion for weakly-dependent data on graph for metro passenger flow prediction",
    "authors": "Ziyue Li and Nurettin Dorukhan Sergin and Hao Yan and Chen Zhang and Fugee Tsung",
    "venue": "Proceedings of the AAAI Conference on Artificial Intelligence",
    "year": 2020,
    "citations": 75,
    "url": "https://ojs.aaai.org/index.php/AAAI/article/view/5915",
    "eprint_url": "",
    "abstract": "Low-rank tensor decomposition and completion have attracted significant interest from academia given the ubiquity of tensor data. However, low-rank structure is a global property, which will not be fulfilled when the data presents complex and weak dependencies given specific graph structures. One particular application that motivates this study is the spatiotemporal data analysis. As shown in the preliminary study, weakly dependencies can worsen the low-rank tensor completion performance. In this paper, we propose a novel low-rank CANDECOMP/PARAFAC (CP) tensor decomposition and completion framework by introducing the L 1-norm penalty and Graph Laplacian penalty to model the weakly dependency on graph. We further propose an efficient optimization algorithm based on the Block Coordinate Descent for efficient estimation. A case study based on the metro passenger flow data in Hong Kong is conducted to demonstrate an improved performance over the regular tensor completion methods."
  },
  {
    "title": "Weakly correlated profile monitoring based on sparse multi-channel functional principal component analysis",
    "authors": "Chen Zhang and Hao Yan and Seungho Lee and Jianjun Shi",
    "venue": "IISE Transactions",
    "year": 2018,
    "citations": 60,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2018.1451012",
    "eprint_url": "",
    "abstract": "Although several works have been proposed for multi-channel profile monitoring, two additional challenges are yet to be addressed: (i) how to model complex correlations of multi-channel profiles when different profiles have different features (i.e., weakly or sparsely correlated); (ii) how to efficiently detect sparse changes occurring in only a small segment of a few profiles. To fill this research gap, our contributions are twofold. First, we propose a novel Sparse Multi-channel Functional Principal Component Analysis (SMFPCA) to model multi-channel profiles. SMFPCA can not only flexibly describe the correlation structure of multiple, or even high-dimensional, profiles with distinct features, but also achieve sparse PCA scores which are easily interpretable. Second, we propose an efficient convergence-guaranteed optimization algorithm to solve SMFPCA in real time based on the block coordinate descent algorithm …"
  },
  {
    "title": "Multiple profiles sensor-based monitoring and anomaly detection",
    "authors": "Chen Zhang and Hao Yan and Seungho Lee and Jianjun Shi",
    "venue": "Journal of Quality Technology",
    "year": 2018,
    "citations": 52,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00224065.2018.1508275",
    "eprint_url": "",
    "abstract": "Generally, in an advanced manufacturing system hundreds of sensors are deployed to measure key process variables in real time. Thus it is desirable to develop methodologies to use real-time sensor data for on-line system condition monitoring and anomaly detection. However, there are several challenges in developing an effective process monitoring system: (i) data streams generated by multiple sensors are high-dimensional profiles; (ii) sensor signals are affected by noise due to system-inherent variations; (iii) signals of different sensors have cluster-wise features; and (iv) an anomaly may cause only sparse changes of sensor signals. To address these challenges, this article presents a real-time multiple profiles sensor-based process monitoring system, which includes the following modules: (i) preprocessing sensor signals to remove inherent variations and conduct profile alignments, (ii) using multichannel …"
  },
  {
    "title": "Long-short term spatiotemporal tensor prediction for passenger flow profile",
    "authors": "Ziyue Li and Hao Yan and Chen Zhang and Fugee Tsung",
    "venue": "IEEE Robotics and Automation Letters",
    "year": 2020,
    "citations": 47,
    "url": "https://ieeexplore.ieee.org/abstract/document/9126133/",
    "eprint_url": "",
    "abstract": "Spatiotemporal data are very common in many applications, such as manufacturing systems and transportation systems. Given the intrinsic complex spatial and temporal correlations of such data, short-term and long-term prediction for spatiotemporal data is often very challenging. Most of the traditional statistical models fail to preserve innate features in data alongside their complex correlations. In this paper, we focus on a tensor-based prediction method and propose several practical techniques to improve both long-term and short-term prediction accuracy. For long-term prediction, we propose the “tensor decomposition + 2-Dimensional Auto-Regressive Moving Average (2D-ARMA)” model, and an effective way to update prediction in real-time; For short-term prediction, we propose to conduct tensor completion based on tensor clustering to avoid oversimplification and ensure accuracy. A case study based on the …"
  },
  {
    "title": "Dynamic multivariate functional data modeling via sparse subspace learning",
    "authors": "Chen Zhang and Hao Yan and Seungho Lee and Jianjun Shi",
    "venue": "Technometrics",
    "year": 2021,
    "citations": 45,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00401706.2020.1800516",
    "eprint_url": "",
    "abstract": "Multivariate functional data from a complex system are naturally high-dimensional and have a complex cross-correlation structure. The complexity of data structure can be observed as that (1) some functions are strongly correlated with similar features, while some others may have almost no cross-correlations with quite diverse features; and (2) the cross-correlation structure may also change over time due to the system evolution. With this regard, this article presents a dynamic subspace learning method for multivariate functional data modeling. In particular, we consider that different functions come from different subspaces, and only functions of the same subspace have cross-correlations with each other. The subspaces can be automatically formulated and learned by reformatting the problem as a sparse regression. By allowing but regularizing the regression change over time, we can describe the cross-correlation …"
  },
  {
    "title": "Online monitoring of big data streams: A rank-based sampling algorithm by data augmentation",
    "authors": "Xiaochen Xian and Chen Zhang and Scott Bonk and Kaibo Liu",
    "venue": "Journal of Quality Technology",
    "year": 2021,
    "citations": 45,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00224065.2019.1681924",
    "eprint_url": "",
    "abstract": "In many applications of modern quality control, process monitoring involves a large number of process variables and quality characteristics. Practitioners are desired to attain complete information about the process in order to assure quick detection of shifts that may possibly occur at any variable. However, full information is not always available during online monitoring of big data streams due to limitations of monitoring resources in practice. In this paper, a rank-based monitoring and sampling algorithm based on data augmentation is proposed to quickly detect the mean shifts in a process when only a limited portion of observations are available online. Specifically, at each observation time, the proposed method will automatically augment information for unobservable variables based on the online observations, and then intelligently allocate the monitoring resources to the most suspicious data streams. Comparing …"
  },
  {
    "title": "Spatial rank-based high-dimensional monitoring through random projection",
    "authors": "Chen Zhang and Nan Chen and Jianguo Wu",
    "venue": "Journal of Quality Technology",
    "year": 2020,
    "citations": 40,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00224065.2019.1571336",
    "eprint_url": "",
    "abstract": "High-dimensional process monitoring becomes increasingly important in many applications where the joint distribution of process variables is usually unknown and not normal, and requires nonparametric methods for analysis and monitoring. However, when the process dimension is much larger than the reference sample size, most traditional nonparametric multivariate control charts fail due to the curse of dimensionality. Furthermore, when the process goes out of control, only a few (sparse) dimensions will be influenced, which increases the difficulty for both detection and diagnosis. To address these problems, this article proposes a new nonparametric monitoring scheme for high-dimensional processes. This scheme first projects the high-dimensional process into several subprocesses using ensemble random projections for dimension reduction. Then, for each subprocess a local nonparametric control chart is …"
  },
  {
    "title": "Dynamic causal graph convolutional network for traffic prediction",
    "authors": "Junpeng Lin and Ziyue Li and Zhishuai Li and Lei Bai and Rui Zhao and Chen Zhang",
    "venue": "Unknown Venue",
    "year": 2023,
    "citations": 39,
    "url": "https://ieeexplore.ieee.org/abstract/document/10260564/",
    "eprint_url": "",
    "abstract": "Modeling complex spatiotemporal dependencies in correlated traffic series is essential for traffic prediction. While recent works have shown improved prediction performance by using neural networks to extract spatiotemporal correlations, their effectiveness depends on the quality of the graph structures used to represent the spatial topology of the traffic network. In this work, we propose a novel approach for traffic prediction that embeds time-varying dynamic Bayesian network to capture the fine spatiotemporal topology of traffic data. We then use graph convolutional networks to generate traffic forecasts. To enable our method to efficiently model nonlinear traffic propagation patterns, we develop a deep learning-based module as a hyper-network to generate stepwise dynamic causal graphs. Our experimental results on a real traffic dataset demonstrate the superior prediction performance of the proposed method."
  },
  {
    "title": "Individualized passenger travel pattern multi-clustering based on graph regularized tensor latent dirichlet allocation",
    "authors": "Ziyue Li and Hao Yan and Chen Zhang and Fugee Tsung",
    "venue": "Data Mining and Knowledge Discovery",
    "year": 2022,
    "citations": 33,
    "url": "https://link.springer.com/article/10.1007/s10618-022-00842-3",
    "eprint_url": "",
    "abstract": "Individual passenger travel patterns have significant value in understanding passenger’s behavior, such as learning the hidden clusters of locations, time, and passengers. The learned clusters further enable commercially beneficial actions such as customized services, promotions, data-driven urban-use planning, peak hour discovery, and so on. However, the individualized passenger modeling is very challenging for the following reasons: 1) The individual passenger travel data are multi-dimensional spatiotemporal big data, including at least the origin, destination, and time dimensions; 2) Moreover, individualized passenger travel patterns usually depend on the external environment, such as the distances and functions of locations, which are ignored in most current works. This work proposes a multi-clustering model to learn the latent clusters along the multiple dimensions of Origin, Destination, Time, and …"
  },
  {
    "title": "Partially observable multi-sensor sequential change detection: A combinatorial multi-armed bandit approach",
    "authors": "Chen Zhang and Steven CH Hoi",
    "venue": "Proceedings of the AAAI Conference on Artificial Intelligence",
    "year": 2019,
    "citations": 24,
    "url": "https://aaai.org/ojs/index.php/AAAI/article/view/4519",
    "eprint_url": "",
    "abstract": "This paper explores machine learning to address a problem of Partially Observable Multi-sensor Sequential Change Detection (POMSCD), where only a subset of sensors can be observed to monitor a target system for change-point detection at each online learning round. In contrast to traditional Multisensor Sequential Change Detection tasks where all the sensors are observable, POMSCD is much more challenging because the learner not only needs to detect on-the-fly whether a change occurs based on partially observed multi-sensor data streams, but also needs to cleverly choose a subset of informative sensors to be observed in the next learning round, in order to maximize the overall sequential change detection performance. In this paper, we present the first online learning study to tackle POMSCD in a systemic and rigorous way. Our approach has twofold novelties:(i) we attempt to detect changepoints from partial observations effectively by exploiting potential correlations between sensors, and (ii) we formulate the sensor subset selection task as a Multi-Armed Bandit (MAB) problem and develop an effective adaptive sampling strategy using MAB algorithms. We offer theoretical analysis for the proposed online learning solution, and further validate its empirical performance via an extensive set of numerical studies together with a case study on real-world data sets."
  },
  {
    "title": "Robust multivariate control chart based on goodness-of-fit test",
    "authors": "Chen Zhang and Nan Chen and Changliang Zou",
    "venue": "Journal of Quality Technology",
    "year": 2016,
    "citations": 24,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00224065.2016.11918156",
    "eprint_url": "",
    "abstract": "This paper proposes a distribution-free multivariate statistical process control (MSPC) chart to detect general distributional changes in multivariate process variables. The chart is deployed based on a multivariate goodness-of-fit test, which is extendible to high-dimensional observations. The chart also employs data-dependent control limits, which are computed on line along with the charting statistics, to ensure satisfactory and robust charting performance of the proposed method. Through theoretical and numerical analyses, we have shown that the proposed chart is exactly distribution-free and able to operate with an unknown in-control (IC) distribution or limited reference samples. The chart also has robust IC performance as well as satisfactory out-of-control (OC) detection power for general process changes without any assumption of the process distribution. A real-data example in semiconductor production …"
  },
  {
    "title": "Multi-agent causal discovery using large language models",
    "authors": "Hao Duong Le and Xin Xia and Zhang Chen",
    "venue": "arXiv preprint arXiv:2407.15073",
    "year": 2024,
    "citations": 22,
    "url": "https://arxiv.org/abs/2407.15073",
    "eprint_url": "",
    "abstract": "Causal discovery aims to identify causal relationships between variables and is a critical research area in machine learning. Traditional methods focus on statistical or machine learning algorithms to uncover causal links from structured data, often overlooking the valuable contextual information provided by metadata. Large language models (LLMs) have shown promise in creating unified causal discovery frameworks by incorporating both structured data and metadata. However, their potential in multi-agent settings remains largely unexplored. To address this gap, we introduce the Multi-Agent Causal Discovery Framework (MAC), which consists of two key modules: the Debate-Coding Module (DCM) and the Meta-Debate Module (MDM). The DCM begins with a multi-agent debating and coding process, where agents use both structured data and metadata to collaboratively select the most suitable statistical causal discovery (SCD) method. The selected SCD is then applied to the structured data to generate an initial causal graph. This causal graph is transformed into causal metadata through the Meta Fusion mechanism. With all the metadata, MDM then refines the causal structure by leveraging a multi-agent debating framework. Extensive experiments across five datasets demonstrate that MAC outperforms both traditional statistical causal discovery methods and existing LLM-based approaches, achieving state-of-the-art performance."
  },
  {
    "title": "A Bayesian Partially Observable Online Change Detection Approach with Thompson Sampling",
    "authors": "Jie Guo and Hao Yan and Chen Zhang",
    "venue": "Technometrics",
    "year": 2023,
    "citations": 21,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00401706.2022.2127914",
    "eprint_url": "",
    "abstract": "This article proposes a Bayesian learning framework for online change detection of high-dimensional data streams where only a subset of variables can be observed at each time point due to limited sensing capacities. On the one hand, we need to build a change detection scheme based on partial observations. On the other, the scheme should be able to adaptively and actively select the most critical sensing variables to observe to maximize the detection power. To address these two points, in this article, first, a novel Bayesian Spike-Slab Composite Decomposition (BSSCD) is proposed to decompose the high-dimensional signals onto normal and abnormal bases, where the projection coefficients are efficiently estimated via variational Bayesian inference. Built upon it, the posterior Bayes factor is constructed as the detection statistic. Second, by further formulating the detection statistic as the reward function of …"
  },
  {
    "title": "MM-DAG: Multi-task DAG Learning for Multi-modal Data--with Application for Traffic Congestion Analysis",
    "authors": "Tian Lan and Ziyue Li and Zhishuai Li and Lei Bai and Man Li and Fugee Tsung and Wolfgang Ketter and Rui Zhao and Chen Zhang",
    "venue": "Unknown Venue",
    "year": 2023,
    "citations": 20,
    "url": "https://dl.acm.org/doi/abs/10.1145/3580305.3599436",
    "eprint_url": "",
    "abstract": "This paper proposes to learn Multi-task, Multi-modal Direct Acyclic Graphs (MM-DAGs), which are commonly observed in complex systems, e.g., traffic, manufacturing, and weather systems, whose variables are multi-modal with scalars, vectors, and functions. This paper takes the traffic congestion analysis as a concrete case, where a traffic intersection is usually regarded as a DAG. In a road network of multiple intersections, different intersections can only have someoverlapping and distinct variables observed. For example, a signalized intersection has traffic light-related variables, whereas unsignalized ones do not. This encourages the multi-task design: with each DAG as a task, the MM-DAG tries to learn the multiple DAGs jointly so that their consensus and consistency are maximized. To this end, we innovatively propose a multi-modal regression for linear causal relationship description of different variables …"
  },
  {
    "title": "Transformer Based Spatial-Temporal Fusion Network for Metro Passenger Flow Forecasting",
    "authors": "Weiqi Zhang and Chen Zhang and Fugee Tsung",
    "venue": "Unknown Venue",
    "year": 2021,
    "citations": 20,
    "url": "https://ieeexplore.ieee.org/abstract/document/9551442/",
    "eprint_url": "",
    "abstract": "Passenger flow forecasting is a very critical task for the daily operations of metro system. The rapid development of deep learning methods offers us an opportunity to give an end-to-end solution to system-level prediction. However, complex spatial-temporal correlations of passenger flow data makes it quite challenging. Existing studies tend to model spatial and temporal correlations separately, which may lead to information loss and unsatisfactory prediction performance. Meanwhile, they cannot take full advantage of human knowledge and external information, such as geographical information, metro map information, etc, for modeling. To bridge the research gap, in this study, we propose a well-designed transformer based spatial-temporal fusion network (TSTFN). To cooperate with different types of external information and give additional insights, we first use multiple pre-defined graph structures to construct multi …"
  },
  {
    "title": "Multi-view metro station clustering based on passenger flows: a functional data-edged network community detection approach",
    "authors": "Chen Zhang and Baihua Zheng and Fugee Tsung",
    "venue": "Data Mining and Knowledge Discovery",
    "year": 2023,
    "citations": 17,
    "url": "https://link.springer.com/article/10.1007/s10618-023-00916-w",
    "eprint_url": "",
    "abstract": "This paper aims at metro station clustering based on passenger flow data. Compared with existing clustering methods that only use boarding or alighting data of each station separately, we focus on higher granularity origin-destination (O-D) path flow data, and provide more flexible and insightful clustering results. In particular, we regard the metro system as a network, with each station as a node. The real-time passenger flows over time between different O-D paths serve as directed edges between nodes. Compared with traditional networks, our edges are temporal curves, and can be regarded as functional data. For this functional data-edged graph, we are the first to develop a novel community detection approach for node clustering. Our method is based on functional factorization. First a dual time-warped sparse nonnegative functional factorization is proposed for extracting patterns of the functional edges. Then …"
  },
  {
    "title": "State space modeling of autocorrelated multivariate Poisson counts",
    "authors": "Chen Zhang and Nan Chen and Zhiguo Li",
    "venue": "IISE Transactions",
    "year": 2017,
    "citations": 16,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2016.1251665",
    "eprint_url": "",
    "abstract": "Although many applications involve autocorrelated multivariate counts, there is a scarcity of research on their statistical modeling. To fill this research gap, this article proposes a state space model to describe autocorrelated multivariate counts. The model builds upon the multivariate log-normal mixture Poisson distribution and allows for serial correlations by considering the Poisson mean vector as a latent process driven by a nonlinear autoregressive model. In this way, the model allows for flexible cross-correlation and autocorrelation structures of count data and can also capture overdispersion. The Monte Carlo Expectation Maximization algorithm, together with particle filtering and smoothing methods, provides satisfactory estimators for the model parameters and the latent process variables. Numerical studies show that, compared with other state-of-the-art models, the proposed model has superiority and more …"
  },
  {
    "title": "Modeling of discharge voltage for lithium-ion batteries through orthogonal experiments at subzero environment",
    "authors": "Huixing Meng and Yan-Fu Li and Chen Zhang",
    "venue": "Journal of Energy Storage",
    "year": 2022,
    "citations": 15,
    "url": "https://www.sciencedirect.com/science/article/pii/S2352152X2201060X",
    "eprint_url": "",
    "abstract": "Lithium-ion batteries have been widely utilized in increasing number of industrial and household domains. The accuracy of the terminal voltage estimation in the discharge processes of lithium-ion batteries is crucial to ensure the availability and safety of battery-powered facilities. In prior studies, the priority of influencing factors of discharging processes, as well as the correlations between operational parameters and model parameters have not been thoroughly considered. In this paper, we conduct an orthogonal experiment of lithium-ion batteries at subzero environment. Based on experiment data, we propose the cubic polynomial to estimate the discharge voltage for lithium-ion batteries at the subzero environment. In our battery experiment, the influencing factors are the charge current, end-of-charge voltage, discharge current, and end-of-discharge voltage. We determine crucial operational parameters in the …"
  },
  {
    "title": "In-profile monitoring for cluster-correlated data in advanced manufacturing system",
    "authors": "Peiyao Liu and Juan Du and Yangyang Zang and Chen Zhang and Kaibo Wang",
    "venue": "Journal of Quality Technology",
    "year": 2023,
    "citations": 12,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00224065.2022.2106912",
    "eprint_url": "",
    "abstract": "Nowadays advanced sensing technology enables real-time data collection of key variables during manufacturing, known as multi-channel profiles. These data facilitate in-process monitoring and anomaly detection, which have been extensively studied in recent years. However, most studies treat each profile as a whole, e.g., a high-dimensional vector or function, and construct monitoring schemes accordingly. As a result, these methods cannot be implemented until the entire profile has been obtained, leading to long detection delay especially if anomalies occur in early sensing points of the profile. In addition, they require that profiles of different samples have the same time length and feature location, yet additional time-warping operation for real misaligned samples may weaken the anomaly patterns. To address these problems, this article proposes an in-profile monitoring (INPOM) control chart, which not only …"
  },
  {
    "title": "Segment-wise time-varying dynamic Bayesian network with graph regularization",
    "authors": "Xing Yang and Chen Zhang and Baihua Zheng",
    "venue": "ACM Transactions on Knowledge Discovery from Data (TKDD)",
    "year": 2022,
    "citations": 12,
    "url": "https://dl.acm.org/doi/abs/10.1145/3522589",
    "eprint_url": "",
    "abstract": "Time-varying dynamic Bayesian network (TVDBN) is essential for describing time-evolving directed conditional dependence structures in complex multivariate systems. In this article, we construct a TVDBN model, together with a score-based method for its structure learning. The model adopts a vector autoregressive (VAR) model to describe inter-slice and intra-slice relations between variables. By allowing VAR parameters to change segment-wisely over time, the time-varying dynamics of the network structure can be described. Furthermore, considering some external information can provide additional similarity information of variables. Graph Laplacian is further imposed to regularize similar nodes to have similar network structures. The regularized maximum a posterior estimation in the Bayesian inference framework is used as a score function for TVDBN structure evaluation, and the alternating direction method …"
  },
  {
    "title": "Monitoring Heterogeneous Multivariate Profiles Based on Heterogeneous Graphical Model",
    "authors": "Hui Wu and Chen Zhang and Yan-Fu Li",
    "venue": "Technometrics",
    "year": 2022,
    "citations": 11,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00401706.2021.1935325",
    "eprint_url": "",
    "abstract": "Process monitoring using profile data remains an important and challenging problem in various manufacturing industries. Motivated by an application case of motherboard testing processes, we develop a novel modeling and monitoring framework for heterogeneous multivariate profiles. In this framework, a heterogeneous graphical model is constructed to depict the complicated heterogeneous relationship among profile channels. Then monitoring the heterogeneous relationship among profile channels can be reduced to monitoring the graphical networks. Besides, we investigate several theoretical results concerning the accuracy of the estimated graphical structure. Finally, we demonstrate the proposed method through extensive simulations and a real case study."
  },
  {
    "title": "Coupled Epidemic-Information Propagation With Stranding Mechanism on Multiplex Metapopulation Networks",
    "authors": "Xuming An and Chen Zhang and Lin Hou and Kaibo Wang",
    "venue": "IEEE Transactions on Computational Social Systems",
    "year": 2024,
    "citations": 9,
    "url": "https://ieeexplore.ieee.org/abstract/document/10557510/",
    "eprint_url": "",
    "abstract": "Acknowledging the significance of information propagation and individual adaptive behavior has been regarded as an indispensable prerequisite for a complete understanding of epidemic spreading. Recent studies have widely considered the metapopulation model, where epidemics spread over a single layer of physical networks via individual mobility. However, these advances neglected the interventions of accompanied information and individual behavior response related to epidemics. In this article, we develop a coupled epidemic-information propagation model on multiplex metapopulation networks leveraging the microscopic Markov chain (MMC) approach, aiming to explore the spatiotemporal characteristics of epidemic spreading process. Taking the individual adaptive behavior into account, the stranding mechanism based on infection level and medical resources is introduced to capture the population …"
  },
  {
    "title": "Nonlinear Causal Discovery via Dynamic Latent Variables",
    "authors": "Xing Yang and Tian Lan and Hao Qiu and Chen Zhang",
    "venue": "IEEE Transactions on Automation Science and Engineering",
    "year": 2025,
    "citations": 8,
    "url": "https://ieeexplore.ieee.org/abstract/document/10848521/",
    "eprint_url": "",
    "abstract": "Distinguishing causality from mere correlation is a cornerstone in empirical research, as conflating the two can result in significant errors in decision-making, affecting policy formulation and the validity of scientific inferences. Traditional experimental designs, such as randomized trials, often fall short in complex systems where variables interact in a high-dimensional space with limited data. This paper aims to address these challenges by introducing an innovative causal discovery approach, extending beyond conventional methodologies by incorporating algorithmic advances in computational efficiency and design. We present a novel double Gaussian process state space causal model (GPSSCM) that contends with the multifaceted nature of causal inference, accounting for noisy observations and latent variables, which are commonly encountered in dynamic systems. Our methodological contribution includes the …"
  },
  {
    "title": "XTraffic: A Dataset Where Traffic Meets Incidents with Explainability and More",
    "authors": "Xiaochuan Gou and Ziyue Li and Tian Lan and Junpeng Lin and Zhishuai Li and Bingyu Zhao and Chen Zhang and Di Wang and Xiangliang Zhang",
    "venue": "arXiv preprint arXiv:2407.11477",
    "year": 2024,
    "citations": 7,
    "url": "https://arxiv.org/abs/2407.11477",
    "eprint_url": "",
    "abstract": "Long-separated research has been conducted on two highly correlated tracks: traffic and incidents. Traffic track witnesses complicating deep learning models, e.g., to push the prediction a few percent more accurate, and the incident track only studies the incidents alone, e.g., to infer the incident risk. We, for the first time, spatiotemporally aligned the two tracks in a large-scale region (16,972 traffic nodes) over the whole year of 2023: our XTraffic dataset includes traffic, i.e., time-series indexes on traffic flow, lane occupancy, and average vehicle speed, and incidents, whose records are spatiotemporally-aligned with traffic data, with seven different incident classes. Additionally, each node includes detailed physical and policy-level meta-attributes of lanes. Our data can revolutionalize traditional traffic-related tasks towards higher interpretability and practice: instead of traditional prediction or classification tasks, we conduct: (1) post-incident traffic forecasting to quantify the impact of different incidents on traffic indexes; (2) incident classification using traffic indexes to determine the incidents types for precautions measures; (3) global causal analysis among the traffic indexes, meta-attributes, and incidents to give high-level guidance of the interrelations of various factors; (4) local causal analysis within road nodes to examine how different incidents affect the road segments' relations. The dataset is available at http://xaitraffic.github.io."
  },
  {
    "title": "Functional state-space model for multi-channel autoregressive profiles with application in advanced manufacturing",
    "authors": "Peng Zhou and Peiyao Liu and Shilong Wang and Chen Zhang and Junxing Zhang and Shaobo Li",
    "venue": "Journal of Manufacturing Systems",
    "year": 2022,
    "citations": 7,
    "url": "https://www.sciencedirect.com/science/article/pii/S027861252200111X",
    "eprint_url": "",
    "abstract": "Multi-channel profile data analysis is an important research topic in modern quality management for advanced manufacturing. The most crucial part is how to model the profile data. Usually, the profiles of sequential manufactured products have auto-correlations and formulate a profile data time series. However, most of the existing studies ignore this auto-correlation and hence set up models with less accurate predictions. This study aims to develop a novel functional state-space model for multi-channel autoregressive profiles. In particular, we expand multi-channel profiles on a set of basis functions. The expansion coefficients are further modeled as evolving according to an autoregressive model. The expectation-maximization algorithm and Kalman filter are used to estimate the expansion coefficients together with the evolving mechanics. Numerical studies and real cases from the manufacturing system show the …"
  },
  {
    "title": "Clustering Subway Station Arrival Patterns Using Weighted Dynamic Time Warping",
    "authors": "Rui Wang and Nan Chen and Chen Zhang",
    "venue": "Unknown Venue",
    "year": 2018,
    "citations": 7,
    "url": "https://ieeexplore.ieee.org/abstract/document/8607368/",
    "eprint_url": "",
    "abstract": "To better plan and schedule public transportation resources, it is crucial to understand the travel demand from any location at any time. In this article, we focus on analyzing the demand patterns for subway stations based on the tap in data at each station entrance. It has been reported that accurately predicting the arrival rates can help improve the travel experience, and prevent over-crowding in train carriages or platforms. We proposed a weighted dynamic time warping approach (WDTW) to adaptively cluster similar patterns from multiple stations. These similarities can be exploited in improving the prediction performance because spatial temporal information is better utilized. We demonstrated our approach and its effectiveness through a real data example."
  },
  {
    "title": "Modeling tunnel profile in the presence of coordinate errors: A Gaussian process-based approach",
    "authors": "Chen Zhang and Yong Lei and Linmiao Zhang and Nan Chen",
    "venue": "IISE Transactions",
    "year": 2017,
    "citations": 7,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2017.1348646",
    "eprint_url": "",
    "abstract": "This article presents a Gaussian process (GP)-based approach to model a tunnel’s inner surface profile with high frequency sensing data provided by a Terrestrial Laser Scanner (TLS). We introduce a reading-surface profile that uniquely determines a three-dimensional tunnel in a Cartesian coordinate system. This reading-surface transforms the cylindrical tunnel to a two-dimensional surface profile, hence allowing us to model the tunnel profile by GP. To account for coordinate errors induced by TLS, we take repeated measurements at designed coordinates. We apply a Taylor approximation to extract mean and gradient estimations from the repeated measurements and then fit the GP model with both estimations to obtain a more robust reconstruction of the tunnel profile. We validate our method through numerical examples. The simulation results show that with the help of derivative estimations, our method …"
  },
  {
    "title": "MultiFun-DAG: Multivariate Functional Directed Acyclic Graph",
    "authors": "Tian Lan and Ziyue Li and Junpeng Lin and Zhishuai Li and Lei Bai and Man Li and Fugee Tsung and Rui Zhao and Chen Zhang",
    "venue": "arXiv preprint arXiv:2404.13836",
    "year": 2024,
    "citations": 6,
    "url": "https://arxiv.org/abs/2404.13836",
    "eprint_url": "",
    "abstract": "Directed Acyclic Graphical (DAG) models efficiently formulate causal relationships in complex systems. Traditional DAGs assume nodes to be scalar variables, characterizing complex systems under a facile and oversimplified form. This paper considers that nodes can be multivariate functional data and thus proposes a multivariate functional DAG (MultiFun-DAG). It constructs a hidden bilinear multivariate function-to-function regression to describe the causal relationships between different nodes. Then an Expectation-Maximum algorithm is used to learn the graph structure as a score-based algorithm with acyclic constraints. Theoretical properties are diligently derived. Prudent numerical studies and a case study from urban traffic congestion analysis are conducted to show MultiFun-DAG's effectiveness."
  },
  {
    "title": "A sequential bayesian partitioning approach for online steady-state detection of multivariate systems",
    "authors": "Jianguo Wu and Honglun Xu and Chen Zhang and Yuan Yuan",
    "venue": "IEEE Transactions on Automation Science and Engineering",
    "year": 2019,
    "citations": 6,
    "url": "https://ieeexplore.ieee.org/abstract/document/8667062/",
    "eprint_url": "",
    "abstract": "The steady-state detection is critically important in many engineering fields, such as fault detection and diagnosis and process monitoring and control. However, most of the existing methods were designed for univariate signals and, thus, are not effective in handling multivariate signals. In this paper, we propose an efficient online steady-state detection method for multivariate systems through a sequential Bayesian partitioning approach. The signal is modeled by a Bayesian piecewise constant mean and covariance model, and a recursive updating method is developed to calculate the posterior distributions analytically. The duration of the current segment is utilized for steady-state testing. Insightful guidance is also provided for hyperparameter selection. The effectiveness of the proposed method is demonstrated through thorough numerical and real case studies."
  },
  {
    "title": "A hidden markov model for condition monitoring of time series data in complex network systems",
    "authors": "Wanshan Li and Chen Zhang",
    "venue": "IEEE Transactions on Reliability",
    "year": 2023,
    "citations": 5,
    "url": "https://ieeexplore.ieee.org/abstract/document/10025504/",
    "eprint_url": "",
    "abstract": "Time series data are ubiquitous in complex network systems, where each component of the system is treated as a vertex and has sequentially collected autocorrelated observations for condition monitoring. In many cases, components transit between different states, such as “normal,” “degrading,” “failure,” etc., and under different states their distributions vary, resulting in the mixture marginal distribution of each vertex's time series data. Moreover, states of different components influence each other through the system's network topology, i.e., the state of a component itself and its neighbors jointly affect its data distribution. For efficient condition monitoring, it is important to capture the state evolution of all vertices as a whole over time. However, the state-switching may be unobservable, which complicates the modeling. Hence, this article proposes a hidden Markov model for networked time series data with mixture …"
  },
  {
    "title": "A data-driven method for online monitoring tube wall thinning process in dynamic noisy environment",
    "authors": "Chen Zhang and Jun Long Lim and Ouyang Liu and Aayush Madan and Yongwei Zhu and Shili Xiang and Kai Wu and Rebecca Yen-Ni Wong and Jiliang Eugene Phua and Karan M Sabnani and Keng Boon Siah and Wenyu Jiang and Yixin Wang and Emily Jianzhong Hao and Steven CH Hoi",
    "venue": "IEEE Transactions on Automation Science and Engineering",
    "year": 2021,
    "citations": 5,
    "url": "https://ieeexplore.ieee.org/abstract/document/9327498/",
    "eprint_url": "",
    "abstract": "Tube internal erosion, which corresponds to its wall thinning process, is one of the major safety concerns for tubes. Many sensing technologies have been developed to detect a tube wall thinning process. Among them, fiber Bragg grating (FBG) sensors are the most popular ones due to their precise measurement properties. Most of the current works focus on how to design different types of FBG sensors according to certain physical laws and only test their sensors in controlled laboratory conditions. However, in practice, an industrial system usually suffers from harsh and dynamic environmental conditions, and FBG signals are affected by many unpredictable factors. Consequently, the FBG signals have more fluctuations and are polluted by noises. Hence, the signals no longer directly follow the assumed physical laws and their proposed thinning detection mechanisms no longer work. Targeting at this, this article …"
  },
  {
    "title": "A Markov-switching hidden heterogeneous network autoregressive model for multivariate time series data with multimodality",
    "authors": "Wanshan Li and Chen Zhang",
    "venue": "IISE Transactions",
    "year": 2023,
    "citations": 4,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2022.2148780",
    "eprint_url": "",
    "abstract": "Multivariate networked time series data are ubiquitous in many applications, where multiple variables of interest are sequentially collected over time for each vertex as multivariate time series. Data of different vertices may have heterogeneous influence on each other through the network topology. These time series may usually exhibit multimodal marginal distributions, due to complex system variations. In this article, we propose a novel approach for such data modeling. In particular, we assume that each vertex has multiple latent states and exhibits state-switching behaviors according to a Markov process. The multivariate time series of each vertex depend on a defined latent effect variable influenced by both its own latent state and the latent effects of its neighbors through a heterogeneous network autoregressive model according to the network topology. Furthermore, the influence of some exogenous covariates on …"
  },
  {
    "title": "Thompson Sampling-Based Partially Observable Online Change Detection for Exponential Families",
    "authors": "Jie Guo and Hao Yan and Chen Zhang",
    "venue": "INFORMS Journal on Data Science",
    "year": 2024,
    "citations": 3,
    "url": "https://pubsonline.informs.org/doi/abs/10.1287/ijds.2022.00011",
    "eprint_url": "",
    "abstract": "This paper proposes a holistic sequential change detection framework for partially observable high-dimensional data streams with exponential-family distributions. The framework first proposes a general composite decomposition for exponential-family distributed data by projecting its natural parameter onto normal bases and abnormal bases, which enables efficient inference for sparse changes. Then, the inference results are used for detection scheme construction, and different types of test statistics can be compacted in our framework. Last, by further designing the test statistic as the reward function in the combinatorial multi-armed bandit problem, a Thompson sampling-based sensor allocation strategy is constructed to select the most anomalous variables. Theoretical properties of the detection framework are discussed. Finally, examples of Gaussian, Poisson, and binomial distributed data streams are given in …"
  },
  {
    "title": "Multi-Scenario Cellular KPI Prediction Based on Spatiotemporal Graph Neural Network",
    "authors": "Junpeng Lin and Tian Lan and Bo Zhang and Ke Lin and Dandan Miao and Huiru He and Jiantao Ye and Chen Zhang and Yan-Fu Li",
    "venue": "IEEE Transactions on Automation Science and Engineering",
    "year": 2024,
    "citations": 3,
    "url": "https://ieeexplore.ieee.org/abstract/document/10571823/",
    "eprint_url": "",
    "abstract": "With the increasing demand for high-quality telecommunication services, cellular KPI prediction becomes crucial for telecommunication network monitoring and management. In this work, we propose a novel framework for cellular KPI prediction, which considers its distribution discrepancy under different network operation scenarios. In particular, three specific predictors for normal, target alarm, and neighbor alarm scenarios are proposed based on spatiotemporal graph neural networks and unified through transfer learning. Temporal convolution and attention mechanism are embedded to model the impact of anomalies on KPIs and its propagation across neighboring cells according to the cellular network topology. An experiment on a real cellular KPI dataset shows the effectiveness of the proposed method compared to the state-of-the-arts. Note to Practitioners—Cellular network KPI prediction under scenarios of …"
  },
  {
    "title": "Online directed-structural change-point detection: A segment-wise time-varying dynamic Bayesian network approach",
    "authors": "Xing Yang and Chen Zhang",
    "venue": "IISE Transactions",
    "year": 2024,
    "citations": 3,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2023.2207252",
    "eprint_url": "",
    "abstract": "High-dimensional data streams exist in many applications. Generally these high-dimensional streaming data have complex directed conditional dependence relationships evolving over time. However, modeling their directed conditional dependence structure and detecting its change over time in an online way has not been well studied in the current literature. To that end, we propose an ONline Segment-wise tiMe-varying dynAmic Bayesian netwoRk model with exTernal information (ONSMART), together with an online score-based inferring algorithm for directed-structural change-point detection in high-dimensional data. ONSMART adopts a linear vector autoregressive (VAR) model to describe directed inter-slice and intra-slice relations of variables. It further takes additional information about similarities of variables into account and regularizes similar variables to have similar structure positions in the network with …"
  },
  {
    "title": "Tensor Dirichlet Process Multinomial Mixture Model with Graphs for Passenger Trajectory Clustering",
    "authors": "Ziyue Li and Hao Yan and Chen Zhang and Wolfgang Ketter and Fugee Tsung",
    "venue": "Unknown Venue",
    "year": 2023,
    "citations": 3,
    "url": "https://dl.acm.org/doi/abs/10.1145/3615886.3627749",
    "eprint_url": "",
    "abstract": "Passenger clustering based on trajectory records is essential for transportation operators. However, existing methods cannot easily cluster the passengers due to the hierarchical structure of the passenger trip information, including multiple trips within each passenger and multi-dimensional information about each trip. Furthermore, existing approaches rely on an accurate specification of the clustering number to start. Finally, existing methods do not consider spatial semantic graphs such as geographical proximity and functional similarity between the locations. In this paper, we propose a novel tensor Dirichlet Process Multinomial Mixture model with graphs, which can preserve the hierarchical structure of the multi-dimensional trip information and cluster them in a unified one-step manner with the ability to determine the number of clusters automatically. The spatial graphs are utilized in community detection to link …"
  },
  {
    "title": "Choose A Table: Tensor Dirichlet Process Multinomial Mixture Model with Graphs for Passenger Trajectory Clustering",
    "authors": "Ziyue Li and Hao Yan and Chen Zhang and Lijun Sun and Wolfgang Ketter and Fugee Tsung",
    "venue": "arXiv preprint arXiv:2310.20224",
    "year": 2023,
    "citations": 3,
    "url": "https://arxiv.org/abs/2310.20224",
    "eprint_url": "",
    "abstract": "Passenger clustering based on trajectory records is essential for transportation operators. However, existing methods cannot easily cluster the passengers due to the hierarchical structure of the passenger trip information, including multiple trips within each passenger and multi-dimensional information about each trip. Furthermore, existing approaches rely on an accurate specification of the clustering number to start. Finally, existing methods do not consider spatial semantic graphs such as geographical proximity and functional similarity between the locations. In this paper, we propose a novel tensor Dirichlet Process Multinomial Mixture model with graphs, which can preserve the hierarchical structure of the multi-dimensional trip information and cluster them in a unified one-step manner with the ability to determine the number of clusters automatically. The spatial graphs are utilized in community detection to link the semantic neighbors. We further propose a tensor version of Collapsed Gibbs Sampling method with a minimum cluster size requirement. A case study based on Hong Kong metro passenger data is conducted to demonstrate the automatic process of cluster amount evolution and better cluster quality measured by within-cluster compactness and cross-cluster separateness. The code is available at https://github.com/bonaldli/TensorDPMM-G."
  },
  {
    "title": "Crowding Prediction of In-Situ Metro Passengers Using Smart Card Data",
    "authors": "Xiancai Tian and Chen Zhang and Baihua Zheng",
    "venue": "arXiv preprint arXiv:2009.02880",
    "year": 2020,
    "citations": 3,
    "url": "https://arxiv.org/abs/2009.02880",
    "eprint_url": "",
    "abstract": "The metro system is playing an increasingly important role in the urban public transit network, transferring a massive human flow across space everyday in the city. In recent years, extensive research studies have been conducted to improve the service quality of metro systems. Among them, crowd management has been a critical issue for both public transport agencies and train operators. In this paper, by utilizing accumulated smart card data, we propose a statistical model to predict in-situ passenger density, i.e., number of on-board passengers between any two neighbouring stations, inside a closed metro system. The proposed model performs two main tasks: i) forecasting time-dependent Origin-Destination (OD) matrix by applying mature statistical models; and ii) estimating the travel time cost required by different parts of the metro network via truncated normal mixture distributions with Expectation-Maximization (EM) algorithm. Based on the prediction results, we are able to provide accurate prediction of in-situ passenger density for a future time point. A case study using real smart card data in Singapore Mass Rapid Transit (MRT) system demonstrate the efficacy and efficiency of our proposed method."
  },
  {
    "title": "Statistical analysis of simulation output from parallel computing",
    "authors": "Chen Zhang and Nan Chen",
    "venue": "ACM Transactions on Modeling and Computer Simulation (TOMACS)",
    "year": 2018,
    "citations": 3,
    "url": "https://dl.acm.org/doi/abs/10.1145/3186327",
    "eprint_url": "",
    "abstract": "This article addresses statistical output analysis of transient simulations in the parallel computing environment with fixed computing time. Using parallel computing, most commonly used unbiased estimators based on the output sequence compromise. To rectify this issue, this article proposes an estimation procedure in the Bayesian framework. The proposed procedure is particularly useful when the computing time depends on the output value in each simulation replication. The effectiveness of our method is demonstrated through studies on queuing simulation and control chart simulation."
  },
  {
    "title": "Spectral network approach for multi-channel profile data analysis with applications in advanced manufacturing",
    "authors": "Chen Zhang and Linmiao Zhang and Nan Chen",
    "venue": "Unknown Venue",
    "year": 2017,
    "citations": 3,
    "url": "https://ieeexplore.ieee.org/abstract/document/8290183/",
    "eprint_url": "",
    "abstract": "In the advanced manufacturing, a lot of sensors are used to collect real-time process signals for statistical monitoring. Motivated by the complex correlation structures of these multi-channel profile signals, this paper proposes a monitoring scheme for their cross-correlations with the help of spectral network approaches. In particular, we first construct a network model for multi-channel profiles by extracting their features based on the multi-channel functional PCA. The topological structure of the network can represent the cross-correlations of multi-channel profiles. Then we propose to monitor the topological structure using its spectrum information. Numerical studies in a certain fabrication process demonstrate the applicability and efficiency of the proposed methodology."
  },
  {
    "title": "Stream of variation modeling and monitoring for heterogeneous profiles in multi-stage manufacturing processes",
    "authors": "Peiyao Liu and Yujie Ma and Chen Zhang",
    "venue": "IISE Transactions",
    "year": 2024,
    "citations": 2,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2024.2413122",
    "eprint_url": "",
    "abstract": "Advanced manufacturing systems typically involve multiple operating stages, where in-process data are observed in the form of profiles that contain rich information for process monitoring. Emerging methodologies have been developed for multi-stage profile monitoring. However, the cases where different stages’ profiles are heterogeneous and variations propagate over stages have not been addressed so far. To this end, this article proposes a heterogeneous profiles-based stream of variation (HP-SoV) framework for multi-stage manufacturing process monitoring. It uses functional decomposition to extract features of heterogeneous profiles from different stages, where the decomposition coefficients are regarded as latent states that propagate along consecutive stages to capture the variation propagation. HP-SoV includes many existing models as its special cases, and enjoys an efficient inference algorithm via …"
  },
  {
    "title": "A comprehensive survey of recent research on profile data analysis",
    "authors": "Peiyao Liu and Haijie Xu and Chen Zhang",
    "venue": "Unknown Venue",
    "year": 2024,
    "citations": 2,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/00224065.2024.2369933",
    "eprint_url": "",
    "abstract": "Nowadays advanced sensing technology enables high-resolution in-process data collection in various systems, known as profile data. These data facilitate in-process monitoring and anomaly detection, which have been extensively studied in recent years. This paper conducts a comprehensive survey on the recent literature for profile modeling and monitoring, including linear profiles, nonlinear profiles, spatial profiles, multi-stage profiles, profile network data, and partially observable profiles, covering techniques such as functional data analysis, tensor analysis, deep learning, etc. By summarizing the developments and challenges associated with the reviewed papers, this paper aims to provide researchers and practitioners with a valuable resource for understanding the latest research advances."
  },
  {
    "title": "Reverse logistics platform decisions integrating crowdsourced contracting: A three-level interactive optimization approach for product design considering remanufacturing",
    "authors": "Yujie Ma and Chen Zhang and Gang Du",
    "venue": "Computers & Industrial Engineering",
    "year": 2024,
    "citations": 2,
    "url": "https://www.sciencedirect.com/science/article/pii/S0360835224004261",
    "eprint_url": "",
    "abstract": "Currently most original equipment manufacturers are reluctant to remanufacture their end-of-life products due to lack of adequate infrastructure for remanufacturing profitable products. To solve the problem, we propose a three-level interactive decision-making framework for product design considering remanufacturing by establishing reverse logistics platform integrating crowdsourced contracting. The reverse logistics platform can incorporate a large population of manufacturer and consumer crowds in an extended manufacturing network. The crowdsourced manufacturing paradigm can maximize the utilization of external resources, thereby enhancing overall remanufacturing efficiency. We propose a three-level mixed 0–1 programming model based on above framework with a Stackelberg game to handle the complex decision-making process. A combination of analytical solutions and a nested genetic algorithm is …"
  },
  {
    "title": "Partially-Observable Sequential Change-Point Detection for Autocorrelated Data via Upper Confidence Region",
    "authors": "Haijie Xu and Xiaochen Xian and Chen Zhang and Kaibo Liu",
    "venue": "arXiv preprint arXiv:2404.00220",
    "year": 2024,
    "citations": 2,
    "url": "https://arxiv.org/abs/2404.00220",
    "eprint_url": "",
    "abstract": "Sequential change point detection for multivariate autocorrelated data is a very common problem in practice. However, when the sensing resources are limited, only a subset of variables from the multivariate system can be observed at each sensing time point. This raises the problem of partially observable multi-sensor sequential change point detection. For it, we propose a detection scheme called adaptive upper confidence region with state space model (AUCRSS). It models multivariate time series via a state space model (SSM), and uses an adaptive sampling policy for efficient change point detection and localization. A partially-observable Kalman filter algorithm is developed for online inference of SSM, and accordingly, a change point detection scheme based on a generalized likelihood ratio test is developed. How its detection power relates to the adaptive sampling strategy is analyzed. Meanwhile, by treating the detection power as a reward, its connection with the online combinatorial multi-armed bandit (CMAB) problem is formulated and an adaptive upper confidence region algorithm is proposed for adaptive sampling policy design. Theoretical analysis of the asymptotic average detection delay is performed, and thorough numerical studies with synthetic data and real-world data are conducted to demonstrate the effectiveness of our method."
  },
  {
    "title": "Holistic Prediction for Public Transport Crowd Flows: A Spatio Dynamic Graph Network Approach",
    "authors": "Bingjie He and Shukai Li and Chen Zhang and Baihua Zheng and Fugee Tsung",
    "venue": "Unknown Venue",
    "year": 2021,
    "citations": 2,
    "url": "https://link.springer.com/chapter/10.1007/978-3-030-86486-6_20",
    "eprint_url": "",
    "abstract": "This paper targets at predicting public transport in-out crowd flows of different regions together with transit flows between them in a city. The main challenge is the complex dynamic spatial correlation of crowd flows of different regions and origin-destination (OD) paths. Different from road traffic flows whose spatial correlations mainly depend on geographical distance, public transport crowd flows significantly relate to the region’s functionality and connectivity in the public transport network. Furthermore, influenced by commuters’ time-varying travel patterns, the spatial correlations change over time. Though there exist many works focusing on either predicting in-out flows or OD transit flows of different regions separately, they ignore the intimate connection between the two tasks, and hence lose efficacy. To solve these limitations in the literature, we propose a Graph spAtio dynamIc Network (GAIN) to describe the …"
  },
  {
    "title": "Time-Warped Sparse Non-negative Factorization for Functional Data Analysis",
    "authors": "Chen Zhang and Steven CH Hoi and Fugee Tsung",
    "venue": "ACM Transactions on Knowledge Discovery from Data (TKDD)",
    "year": 2020,
    "citations": 2,
    "url": "https://dl.acm.org/doi/abs/10.1145/3408313",
    "eprint_url": "",
    "abstract": "This article proposes a novel time-warped sparse non-negative factorization method for functional data analysis. The proposed method on the one hand guarantees the extracted basis functions and their coefficients to be positive and interpretable, and on the other hand is able to handle weakly correlated functions with different features. Furthermore, the method incorporates time warping into factorization and hence allows the extracted basis functions of different samples to have temporal deformations. An efficient framework of estimation algorithms is proposed based on a greedy variable selection approach. Numerical studies together with case studies on real-world data demonstrate the efficacy and applicability of the proposed methodology."
  },
  {
    "title": "Towards Foundation Models for Zero-Shot Time Series Anomaly Detection: Leveraging Synthetic Data and Relative Context Discrepancy",
    "authors": "Tian Lan and Hao Duong Le and Jinbo Li and Wenjun He and Meng Wang and Chenghao Liu and Chen Zhang",
    "venue": "arXiv preprint arXiv:2509.21190",
    "year": 2025,
    "citations": 1,
    "url": "https://arxiv.org/abs/2509.21190",
    "eprint_url": "",
    "abstract": "Time series anomaly detection (TSAD) is a critical task, but developing models that generalize to unseen data in a zero-shot manner remains a major challenge. Prevailing foundation models for TSAD predominantly rely on reconstruction-based objectives, which suffer from a fundamental objective mismatch: they struggle to identify subtle anomalies while often misinterpreting complex normal patterns, leading to high rates of false negatives and positives. To overcome these limitations, we introduce \\texttt{TimeRCD}, a novel foundation model for TSAD built upon a new pre-training paradigm: Relative Context Discrepancy (RCD). Instead of learning to reconstruct inputs, \\texttt{TimeRCD} is explicitly trained to identify anomalies by detecting significant discrepancies between adjacent time windows. This relational approach, implemented with a standard Transformer architecture, enables the model to capture contextual shifts indicative of anomalies that reconstruction-based methods often miss. To facilitate this paradigm, we develop a large-scale, diverse synthetic corpus with token-level anomaly labels, providing the rich supervisory signal necessary for effective pre-training. Extensive experiments demonstrate that \\texttt{TimeRCD} significantly outperforms existing general-purpose and anomaly-specific foundation models in zero-shot TSAD across diverse datasets. Our results validate the superiority of the RCD paradigm and establish a new, effective path toward building robust and generalizable foundation models for time series anomaly detection."
  },
  {
    "title": "SPEVS-CC: Separated parameter estimation with variable selection based on canonical correlation analysis for multivariate functional regression",
    "authors": "Xing Yang and Haijie Xu and Yiming Shi and Chen Zhang",
    "venue": "Advanced Engineering Informatics",
    "year": 2025,
    "citations": 1,
    "url": "https://www.sciencedirect.com/science/article/pii/S147403462500309X",
    "eprint_url": "",
    "abstract": "The rapid advancement of real-time data monitoring technologies has established functional data analysis as a crucial predictive tool across diverse applications. Despite progress in multivariate functional regression and principal component analysis, significant challenges persist in function-to-function regression and feature selection. These include the inaccurate selection of predictor variables from extensive predictors and flawed parameter estimation, which compromise the precision of function-based data predictions. This paper introduces the SPEVS-CC method, a novel canonical correlation-based feature selection technique specifically designed for function-on-function regression. By effectively decoupling variable selection from model fitting, the SPEVS-CC method enhances both adaptability and interpretability. Validated through rigorous experiments and real-world applications, including in the Shenzhen …"
  },
  {
    "title": "Tensor State Space-based Dynamic Multilayer Network Modeling",
    "authors": "Tian Lan and Jie Guo and Chen Zhang",
    "venue": "arXiv preprint arXiv:2506.02413",
    "year": 2025,
    "citations": 1,
    "url": "https://arxiv.org/abs/2506.02413",
    "eprint_url": "",
    "abstract": "Understanding the complex interactions within dynamic multilayer networks is critical for advancements in various scientific domains. Existing models often fail to capture such networks' temporal and cross-layer dynamics. This paper introduces a novel Tensor State Space Model for Dynamic Multilayer Networks (TSSDMN), utilizing a latent space model framework. TSSDMN employs a symmetric Tucker decomposition to represent latent node features, their interaction patterns, and layer transitions. Then by fixing the latent features and allowing the interaction patterns to evolve over time, TSSDMN uniquely captures both the temporal dynamics within layers and across different layers. The model identifiability conditions are discussed. By treating latent features as variables whose posterior distributions are approximated using a mean-field variational inference approach, a variational Expectation Maximization algorithm is developed for efficient model inference. Numerical simulations and case studies demonstrate the efficacy of TSSDMN for understanding dynamic multilayer networks."
  },
  {
    "title": "CICADA: Cross-Domain Interpretable Coding for Anomaly Detection and Adaptation in Multivariate Time Series",
    "authors": "Tian Lan and Yifei Gao and Yimeng Lu and Chen Zhang",
    "venue": "arXiv preprint arXiv:2505.00415",
    "year": 2025,
    "citations": 1,
    "url": "https://arxiv.org/abs/2505.00415",
    "eprint_url": "",
    "abstract": "Unsupervised Time series anomaly detection plays a crucial role in applications across industries. However, existing methods face significant challenges due to data distributional shifts across different domains, which are exacerbated by the non-stationarity of time series over time. Existing models fail to generalize under multiple heterogeneous source domains and emerging unseen new target domains. To fill the research gap, we introduce CICADA (Cross-domain Interpretable Coding for Anomaly Detection and Adaptation), with four key innovations: (1) a mixture of experts (MOE) framework that captures domain-agnostic anomaly features with high flexibility and interpretability; (2) a novel selective meta-learning mechanism to prevent negative transfer between dissimilar domains, (3) an adaptive expansion algorithm for emerging heterogeneous domain expansion, and (4) a hierarchical attention structure that quantifies expert contributions during fusion to enhance interpretability further.Extensive experiments on synthetic and real-world industrial datasets demonstrate that CICADA outperforms state-of-the-art methods in both cross-domain detection performance and interpretability."
  },
  {
    "title": "A Deep Reinforcement Learning Method Solving Bilevel Optimization for Product Design Considering Remanufacturing",
    "authors": "Yujie Ma and Xin Xia and Jie Guo and Chen Zhang",
    "venue": "IEEE Transactions on Engineering Management",
    "year": 2025,
    "citations": 1,
    "url": "https://ieeexplore.ieee.org/abstract/document/10886978/",
    "eprint_url": "",
    "abstract": "Green laws make original equipment manufacturers responsible for full product lifecycle management, emphasizing remanufacturing. Research shows that remanufacturing technologies are complex and costly. Without product designs tailored for remanufacturing, achieving efficiency becomes a significant challenge. Therefore, it is imperative to consider remanufacturing during the initial product design stage. Existing literature primarily proposes either integrated or two-stage optimization methods for the decision-making of manufacturers and remanufacturers. However, they fail to describe the tradeoffs between the decisions of the two stakeholders. This article proposes a leader–follower interactive decision-making framework based on a Stackelberg game to explore the interaction between product design and remanufacturing and construct a bilevel interactive optimization (BIO) model. To solve it, we further …"
  },
  {
    "title": "Low-rank robust subspace tensor clustering for metro passenger flow modeling",
    "authors": "Nurretin Dorukhan Sergin and Jiuyun Hu and Ziyue Li and Chen Zhang and Fugee Tsung and Hao Yan",
    "venue": "INFORMS Journal on Data Science",
    "year": 2025,
    "citations": 1,
    "url": "https://pubsonline.informs.org/doi/abs/10.1287/ijds.2022.0028",
    "eprint_url": "",
    "abstract": "Tensor clustering has become an important topic, specifically in spatiotemporal modeling, because of its ability to cluster spatial modes (e.g., stations or road segments) and temporal modes (e.g., time of day or day of the week). Our motivating example is from subway passenger flow modeling, where similarities between stations are commonly found. However, the challenges lie in the innate high-dimensionality of tensors and also the potential existence of anomalies. This is because the three tasks, that is, dimension reduction, clustering, and anomaly decomposition, are intercorrelated with each other, and treating them in a separate manner will render a suboptimal performance. Thus, in this work, we design a tensor-based subspace clustering and anomaly decomposition technique for simultaneous outlier-robust dimension reduction and clustering for high-dimensional tensors. To achieve this, a novel low-rank …"
  },
  {
    "title": "Federated Multi-task Bayesian Network Learning in the Presence of Overlapping and Distinct Variables",
    "authors": "Xing Yang and Ben Niu and Tian Lan and Chen Zhang",
    "venue": "IISE Transactions",
    "year": 2024,
    "citations": 1,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2024.2443177",
    "eprint_url": "",
    "abstract": "Bayesian Network (BN) is a powerful tool for causal dependence relationship discoveries of multivariate data. This article proposes a federated multi-task learning framework for BNs with overlapping and distinct variables. First, an additive structural causal model is proposed to describe the nonparametric causal dependence structure for each client’s BN. Then by assuming different clients can have similar, yet not identical, causal dependence structures, a two-step federated multi-task learning framework is formulated for parameter learning of different clients, which can protect data privacy in the meanwhile. In the first step, each client updates its local BN parameters with its own data. In the second step, the central server updates global parameters. The two steps iterate until converge. Numerical studies and a case study of a three-phase flow facility data demonstrate the efficacy of our proposed method."
  },
  {
    "title": "MT-RAM: Multi Task-Recurrent Attention Model for partially observable image anomaly classification and localization",
    "authors": "Jie Guo and Congyu Han and Yujie Ma and Chen Zhang",
    "venue": "IISE Transactions",
    "year": 2024,
    "citations": 1,
    "url": "https://www.tandfonline.com/doi/abs/10.1080/24725854.2024.2425292",
    "eprint_url": "",
    "abstract": "With the rapid development of the digital manufacturing industry, the nature of quality data has transformed from simple univariate or multivariate characteristics to big data comprising multimedia elements such as images and videos. The utilization of image data for automated monitoring and anomaly detection has gained significant attention in recent years, which also poses new and complex challenges. A critical challenge is the substantial demand for sensing and computation resources. When these resources are limited, only a fraction of the image data can be observed and analyzed. Hence, adaptive sampling becomes imperative to select the most informative pixels that effectively capture anomaly information. In this article, we propose a novel recurrent neural network framework named Multi Task-Recurrent Attention Model (MT-RAM) which incorporates adaptive sampling for anomaly classification and …"
  },
  {
    "title": "Heterogeneous Multivariate Functional Time Series Modeling: A State Space Approach",
    "authors": "Peiyao Liu and Junpeng Lin and Chen Zhang",
    "venue": "IEEE Transactions on Knowledge and Data Engineering",
    "year": 2024,
    "citations": 1,
    "url": "https://ieeexplore.ieee.org/abstract/document/10713887/",
    "eprint_url": "",
    "abstract": "Functional data have been gaining increasing popularity in the field of time series analysis. However, so far modeling heterogeneous multivariate functional time series remains a research gap. To fill it, this paper proposes a time-varying functional state space model (TV-FSSM). It uses functional decomposition to extract features of the functional observations, where the decomposition coefficients are regarded as latent states that evolve according to a tensor autoregressive model. This two-layer structure can on the one hand efficiently extract continuous functional features, and on the other provide a flexible and generalized description of data heterogeneity among different time points. An expectation maximization (EM) framework is developed for parameter estimation, where regularization and constraints are incorporated for better model interoperability. As the sample size grows, an incremental learning version of …"
  },
  {
    "title": "Advanced Data Analytical Techniques for Profile Monitoring",
    "authors": "Peiyao Liu and Chen Zhang",
    "venue": "Unknown Venue",
    "year": 2024,
    "citations": 1,
    "url": "https://link.springer.com/chapter/10.1007/978-3-031-53092-0_3",
    "eprint_url": "",
    "abstract": "Nowadays advanced sensing technology enables high-resolution in-process data collection during manufacturing, known as profiles or functional data. These data facilitate in-process monitoring and anomaly detection, which have been extensively studied in recent years. Yet three main challenges are the most essential: (i) how to model complex correlation structures of high-dimensional profiles, i.e., cluster-correlated or sparse-correlated profiles, (ii) how to efficiently detect changes before the profile is complete, and (iii) how to characterize the between-stage correlation of multi-stage profiles. To address these three challenges, we accordingly develop three techniques for high-dimensional profile monitoring, in-profile monitoring, and multi-stage profile monitoring."
  },
  {
    "title": "Fine‐Grained Passenger Load Prediction inside Metro Network via Smart Card Data",
    "authors": "Xiancai Tian and Chen Zhang and Baihua Zheng",
    "venue": "International Journal of Intelligent Systems",
    "year": 2024,
    "citations": 1,
    "url": "https://onlinelibrary.wiley.com/doi/abs/10.1155/2024/6643018",
    "eprint_url": "",
    "abstract": "Metro system serves as the backbone for urban public transportation. Accurate passenger load prediction for the metro system plays a crucial role in metro service quality improvement, such as helping operators schedule train timetables and passengers plan their trips. However, existing works can only predict low‐grained passenger flows of origin‐destination (O‐D) paths or inflows/outflows of each station but cannot predict passenger load distribution over the whole metro network. To this end, this paper proposes an end‐to‐end inference framework, PIPE, for passenger load prediction of every metro segment between two adjacent stations, by only utilizing smart card data. In particular, PIPE includes two modules. The first is the core. It formulates the travel time distribution of each metro segment as a truncated Gaussian distribution. Since there might be several possible routes for certain O‐D paths, the population …"
  },
  {
    "title": "A Cluster-Oriented Bayesian Network Approach for Mixed-Type Event Prediction With Application in Order Logistics",
    "authors": "Xing Yang and Hui Cao and Chen Zhang",
    "venue": "IEEE Transactions on Industrial Informatics",
    "year": 2023,
    "citations": 1,
    "url": "https://ieeexplore.ieee.org/abstract/document/10018446/",
    "eprint_url": "",
    "abstract": "Temporal representation and reasoning for probabilistic events describe temporal causal relationships between events. This has been widely used in several applications to predict events accurately. However, there are two challenges: the occurrence time points of events may have distinct types, distributed randomly or at several fixed time points; only limited historical data are available in some cases. This article presents a mixed-type event prediction algorithm based on a cluster-oriented Bayesian network (BN) model to address the highlighted challenges. The proposed model categorizes events as random events or timing events based on their temporal features. The similarity between events is measured according to event types and features. A clustering algorithm for events is further implemented to help reduce the model size and build a simpler and more accurate BN. The experimental results show that the …"
  },
  {
    "title": "AXIS: Explainable Time Series Anomaly Detection with Large Language Models",
    "authors": "Tian Lan and Hao Duong Le and Jinbo Li and Wenjun He and Meng Wang and Chenghao Liu and Chen Zhang",
    "venue": "arXiv preprint arXiv:2509.24378",
    "year": 2025,
    "citations": 0,
    "url": "https://arxiv.org/abs/2509.24378",
    "eprint_url": "",
    "abstract": "Time-series anomaly detection (TSAD) increasingly demands explanations that articulate not only if an anomaly occurred, but also what pattern it exhibits and why it is anomalous. Leveraging the impressive explanatory capabilities of Large Language Models (LLMs), recent works have attempted to treat time series as text for explainable TSAD. However, this approach faces a fundamental challenge: LLMs operate on discrete tokens and struggle to directly process long, continuous signals. Consequently, naive time-to-text serialization suffers from a lack of contextual grounding and representation alignment between the two modalities. To address this gap, we introduce AXIS, a framework that conditions a frozen LLM for nuanced time-series understanding. Instead of direct serialization, AXIS enriches the LLM's input with three complementary hints derived from the series: (i) a symbolic numeric hint for numerical grounding, (ii) a context-integrated, step-aligned hint distilled from a pretrained time-series encoder to capture fine-grained dynamics, and (iii) a task-prior hint that encodes global anomaly characteristics. Furthermore, to facilitate robust evaluation of explainability, we introduce a new benchmark featuring multi-format questions and rationales that supervise contextual grounding and pattern-level semantics. Extensive experiments, including both LLM-based and human evaluations, demonstrate that AXIS yields explanations of significantly higher quality and achieves competitive detection accuracy compared to general-purpose LLMs, specialized time-series LLMs, and time-series Vision Language Models."
  },
  {
    "title": "Bilevel joint optimization for product design changes with a resilient supply chain based on deep reinforcement learning",
    "authors": "Yujie Ma and Xin Xia and Yao Pei and Chen Zhang",
    "venue": "International Journal of Production Economics",
    "year": 2025,
    "citations": 0,
    "url": "https://www.sciencedirect.com/science/article/pii/S0925527325002762",
    "eprint_url": "",
    "abstract": "High-tech supply chains are complex and capital-intensive, making them highly vulnerable to disruptions such as the COVID-19 pandemic and rising geopolitical tensions. Traditional risk management strategies—such as securing backup suppliers and stockpiling inventory—have revealed their limitations. In contrast, integrating product design change (PDC) strategies enables supply chains to adapt and restructure more flexibly, thereby enhancing resilience. This study emphasizes the critical interplay between PDC and resilient supply chains (RSC), proposing a design scheme that integrates both. Because PDC and RSC involve distinct decision-makers with hierarchical decision structures, we further construct a bilevel joint optimization (BJO) framework grounded in a Stackelberg game. To capture this dynamic, a novel bilevel 0–1 nonlinear programming model is formulated, and a bilevel deep reinforcement …"
  },
  {
    "title": "Addressing Glaucoma Structure-Function Relationship: A Multi-Task Learning Framework with Multi-Modal and Unpaired Data",
    "authors": "Xuming An and Jacqueline Chua and Yujin Wang and Ruben Hemelings and Rahat Husain and Rachel Chong and Tina Wong and Tin Aung and Damon Wong and Chen Zhang and Leopold Schmetterer",
    "venue": "IEEE Transactions on Medical Imaging",
    "year": 2025,
    "citations": 0,
    "url": "https://ieeexplore.ieee.org/abstract/document/11141682/",
    "eprint_url": "",
    "abstract": "Glaucoma, an irreversible neurodegenerative disorder, can lead to vision loss and blindness. Visual field (VF) tests are crucial for quantifying functional damage in glaucoma, but the tests are time-consuming and the results have high variations, influenced by subjective behaviors and psychological states of patients. Consequently, predicting VF test results using objective, non-invasive, reproducible optical coherence tomography (OCT) data coupled with deep learning modeling is promising in improving clinical care. However, existing methods only focus on predicting single VF indicators, such as threshold sensitivities or deviation maps, and have poor performance in severe glaucoma. Since different VF indicators are correlated, developing a joint prediction model is beneficial. Furthermore, the availability of more VF test data than corresponding OCTs in most datasets poses a challenge in utilizing unpaired VF …"
  },
  {
    "title": "Quickest Causal Change Point Detection by Adaptive Intervention",
    "authors": "Haijie Xu and Chen Zhang",
    "venue": "arXiv preprint arXiv:2506.07760",
    "year": 2025,
    "citations": 0,
    "url": "https://arxiv.org/abs/2506.07760",
    "eprint_url": "",
    "abstract": "We propose an algorithm for change point monitoring in linear causal models that accounts for interventions. Through a special centralization technique, we can concentrate the changes arising from causal propagation across nodes into a single dimension. Additionally, by selecting appropriate intervention nodes based on Kullback-Leibler divergence, we can amplify the change magnitude. We also present an algorithm for selecting the intervention values, which aids in the identification of the most effective intervention nodes. Two monitoring methods are proposed, each with an adaptive intervention policy to make a balance between exploration and exploitation. We theoretically demonstrate the first-order optimality of the proposed methods and validate their properties using simulation datasets and two real-world case studies."
  },
  {
    "title": "MPOFI: Multichannel Partially Observed Functional Modeling for Defect Classification with Imbalanced Dataset via Deep Metric Learning",
    "authors": "Yukun Xie and Juan Du and Chen Zhang",
    "venue": "arXiv e-prints",
    "year": 2024,
    "citations": 0,
    "url": "https://scholar.google.com/scholar?cluster=1715215220274083861&hl=en&oi=scholarr",
    "eprint_url": "",
    "abstract": "In modern manufacturing, most of the product lines are conforming. Few products are nonconforming but with different defect types. The identification of defect types can help further root cause diagnosis of production lines. With the sensing development, continuous signals of process variables can be collected in high resolution, which can be regarded as multichannel functional data. They have abundant information to characterize the process and help identify the defect types. Motivated by a real example from the pipe tightening process, we target at detect classification when each sample is a multichannel functional data. However, the available samples for each defect type are limited and imbalanced. Moreover, the functions are partially observed since the pre-tightening process before the pipe tightening process is unobserved. To classify the defect samples based on imbalanced, multichannel, and partially …"
  },
  {
    "title": "Functional-Edged Network Modeling",
    "authors": "Haijie Xu and Chen Zhang",
    "venue": "arXiv preprint arXiv:2404.00218",
    "year": 2024,
    "citations": 0,
    "url": "https://arxiv.org/abs/2404.00218",
    "eprint_url": "",
    "abstract": "Contrasts with existing works which all consider nodes as functions and use edges to represent the relationships between different functions. We target at network modeling whose edges are functional data and transform the adjacency matrix into a functional adjacency tensor, introducing an additional dimension dedicated to function representation. Tucker functional decomposition is used for the functional adjacency tensor, and to further consider the community between nodes, we regularize the basis matrices to be symmetrical. Furthermore, to deal with irregular observations of the functional edges, we conduct model inference to solve a tensor completion problem. It is optimized by a Riemann conjugate gradient descent method. Besides these, we also derive several theorems to show the desirable properties of the functional edged network model. Finally, we evaluate the efficacy of our proposed model using simulation data and real metro system data from Hong Kong and Singapore."
  },
  {
    "title": "Deep Cascade-Learning Model via Recurrent Attention for Immunofixation Electrophoresis Image Analysis",
    "authors": "Xuming An and Pengchang Li and Chen Zhang",
    "venue": "IEEE Transactions on Medical Imaging",
    "year": 2023,
    "citations": 0,
    "url": "https://ieeexplore.ieee.org/abstract/document/10248034/",
    "eprint_url": "",
    "abstract": "Immunofixation Electrophoresis (IFE) analysis has been an indispensable prerequisite for the diagnosis of M-protein, which is an important criterion to recognize diversified plasma cell diseases. Existing intelligent methods of IFE diagnosis commonly employ a single unified classifier to directly classify whether M-protein exists and which isotype of M-protein is. However, this unified classification is not optimal because the two tasks have different characteristics and require different feature extraction techniques. Classifying the M-protein existence depends on the presence or absence of dense bands in IFE data, while classifying the M-protein isotype depends on the location of dense bands. Consequently, a cascading two-classifier framework suitable to the two tasks respectively may achieve better performance. In this paper, we propose a novel deep cascade-learning model, which sequentially integrates a positive …"
  }
]